{
	"navigator": {
		"Profile": "プロフィール",
		"Stack": "技術スタック",
		"Experience": "経歴",
		"Portfolio": "ポートフォリオ",
		"Links": "リンク",
		"Loading": "読み込み中"
	},
	"profile": {
		"greeting": "こんにちは！私は",
		"net-name": "0xmmq",
		"real-name": "Wei Tzu Hsiang",
		"job-title": "セキュリティソフトウェアエンジニア",
		"job-title-alt": "ソフトウェアエンジニア",
		"description-1": "私は開発と技術研究に熱心なソフトウェアエンジニアです。過去には主にブロックチェーン関連技術に注力していましたが、現在は情報セキュリティ分野の研究開発エンジニアとして、セキュリティソフトウェアとソフトウェアセキュリティ開発の分野に継続的に取り組んでいます。",
		"description-2": "IT分野に情熱を注いでおり、日常的に様々な新技術とサイバーセキュリティの知識を追跡し、学び続けています。技術記事や学習ノートを書くことがあり、同時に自分のスキルが最新のトレンドに追いついているかを確認するために資格を取得しています。",
		"description-3": "これまで多くの個人やオープンソースプロジェクトを開発し、国内外のチームとも協力してきました。現在は情報セキュリティ分野の開発と研究に注力しており、プロジェクトに関するご質問やご要望がございましたら、お気軽にご連絡ください。",
		"readmore-btn": "詳細を見る",
		"contact-btn": "連絡する"
	},
	"stack": {
		"Language": "プログラミング言語",
		"Backend": "バックエンド",
		"Frontend": "フロントエンド",
		"Operation": "オペレーション",
		"Liberary": "ライブラリ",
		"Tool": "ツール",
		"Design": "デザイン"
	},
	"experience": {
		"dragonsoft": {
			"title": "研究開発エンジニア",
			"organization": "DragonSoft Security Associates, Inc.・フルタイム",
			"location": "板橋区, 新北市, 台湾",
			"time": "2024.09 - 現在",
			"content": "プログラミング言語：Python, TypeScript, Golang\n技術スタック: Gin, Cobra, React, Tailwind CSS, AWS\n経歴:\n1. 脆弱性およびコンプライアンスデータベース構築に関連するツールのプログラム言語変更、リファクタリング、およびその後のメンテナンスを実施し、コードアーキテクチャのメンテナンスをより簡単にします。\n2. 会社のCPE2.3変換ツールアルゴリズムを再設計し、効率を20倍向上させるとともに、スケール性とメンテナンス性を効果的に改善した。\n3. 会社製品の機能追加とメンテナンス。\n4. カブシキガイシャサイクラフト(奧義智慧・台湾)と共同でSEMI E187（ICS Security Protection）製品を開発。\n5. 会社の製品更新プラットフォームの前後端を開発・リリースし、更新ごとのダウンロードトラフィックを約90%削減、時間を20分から5秒以内に短縮した。\n6. 会社のCLIツールを開発し、製品エンドポイント向けに提供しています。更新やクライアントコマンドの実行などの機能を備えています。"
		},
		"axis3d-1": {
			"title": "テクニカルコンサルタント",
			"organization": "Axis3D Technology Co., LTD・パートタイム",
			"location": "内湖区, 台北市, 台湾",
			"time": "2023.09 - 2025.09・1 年",
			"content": "プログラミング言語：Python, TypeScript, Golang, Solidity\n技術スタック: FFMpeg, OpenCV, FastAPI, Gin, Tauri, React, Tailwind CSS, GCP\n経歴:\n1. プロダクトのメンテナンスと新機能の開発を支援。\n2. 技術知識サービスを提供する。"
		},
		"axis3d": {
			"title": "バックエンドエンジニア",
			"organization": "Axis3D Technology Co., LTD・フルタイム",
			"location": "内湖区, 台北市, 台湾",
			"time": "2023.05 - 2024.09・1 年 5ヶ月間",
			"content": "プログラミング言語：Python, TypeScript, Golang, Solidity\n技術スタック：FFMpeg, OpenCV, FastAPI, Gin, Tauri, React, Tailwind CSS, GCP\n経歴：\n1. AI技術を使ったメディアプロダクトの開発と継続的なメンテナンスを担当。このプロダクトは特許を取得してから6ヶ月以内に最低400万台湾ドルの利益を会社にもたらした。また、このプロダクトは同社の少なくとも5つの新しいケースで使用された。\n2. 複数のプロジェクトのバックエンドシステムとAI関連アプリケーションのコーディングをサポート。\n3. GameFiプロジェクトの高並列バックエンドシステムと関連EVMコントラクトの計画・開発、およびシビル攻撃防止のためのDiscordとX Oauthの統合。\n4. 会社の認証サーバーの開発をサポートし、GCPにセットアップしました。同社はプロジェクトを1セット売ると、約1000台湾ドルのハードウェアのコストを削減 \n5. NCDR（国家災害防救科技中心）のプロジェクトでGCB（GPO）の設定をサポートし、会社の外注費用約60万台湾ドルを削減。\n6. 2024年台南ランタンフェスティバルのAI顔交換を開発し、会社の外注費用10万台湾ドルを削減。\n"
		},
		"n3labs": {
			"title": "中国語コミュニティマネージャー",
			"organization": "N3 Labs・パートタイム",
			"location": "千代田区, 東京都, 日本・リモート",
			"time": "2022.10 - 2023.02・5ヶ月間",
			"content": "プログラミング言語：\n技術スタック：\n経歴：\n1. チームのオンラインイベントの企画・デザインをサポート。\n2. イベント用のアート関連作品をデザイン。\n3. Web3セキュリティに関する推奨事項を提供。"
		},
		"izana": {
			"title": "中国語コンサルタント",
			"organization": "IZANA INDUSTRIES Ltd・パートタイム",
			"location": "イギリス領ヴァージン諸島・リモート",
			"time": "2022.09 - 2023.02・6ヶ月間",
			"content": "プログラミング言語：JavaScript\n技術スタック：React\n経歴：\n1. 日本チームの英語・中国語版公式ウェブサイト構築をサポートし、3万人以上の非日本語ユーザーが最新情報を入手できるようにした。\n2. Web3セキュリティに関する推奨事項を提供。\n3. 漫画の英語・中国語翻訳を支援し、英語版は日本で書籍として出版された。"
		},
		"kaiju-of-cronos": {
			"title": "ジュニア開発者",
			"organization": "クロノスの怪獣・パートタイム",
			"location": "アメリカ・リモート",
			"time": "2022.07 - 2023.01・7ヶ月間",
			"content": "プログラミング言語：JavaScript\n技術スタック：Express, React, DiscordJS, BootStrap\n経歴：\n1. 2000人以上が使うメンバー認証システムの開発をサポートし、チームの継続的なボット費用と管理コストを削減。"
		}
	},
	"portfolio": {
		"title": "タイトル",
		"about": "概要",
		"stack": "技術",
		"detail": "詳細",
		"polyme": {
			"about": "PolyMEは私の個人ウェブサイトで、経験、スキル、ポートフォリオなどの情報を紹介しています。どんなことでもお気軽にご連絡ください。",
			"detail": "これは私の開発人生を記録した個人ウェブサイトです。技術的には、Bun、Vite、SWC、Biomeなど、多くの新しいフロントエンドツールチェーンを使用して、開発とコンパイルのプロセスを高速化しています。\n\nさらに、アクセス速度を向上させるため、Caddy 2サーバーを設置して静的ウェブページを処理し、Cloudflare CDNとHttp3を使用してアクセス時間を最小限に抑えています。SEO対策として、Helmet、Open Graph、Google Tag Manager、GA4を使用しています。"
		},
		"quickcerts": {
			"about": "これはシンプルな認証サーバーで、お客様のプロダクトの認証ステータスを検証するために証明書を発行します。",
			"detail": "このプロジェクトは、開発者がアプリケーション用の証明書（キーと署名）を発行するための証明書サーバーを迅速に構築するのを支援することを目的としています。公開キーをアプリケーションに組み込み、署名を使用して、そのキーが設定した証明書サーバーによって発行されたものかどうかを確認し、「プロダクトのアクティベーション」機能を実現します。\n\nさらに、QuickCertsは一時的な許可のサポートも提供しています。アプリケーションが永続的な認証ではなく、「試用期間」や定期的な認証を必要とする場合、関連APIを使用してこれを実現できます。"
		},
		"cpe23-conversion-tool": {
			"about": "これは高性能なNIST CPE2.3検索ツールであり、指定された製品情報に対応するCPE2.3を迅速に検索するために使用されます。",
			"detail": "これはCobraで構築されたCLIツールであり、内部で高効率なコアアルゴリズムを使用しています。ユーザーから提供された情報を一部取り込んだ後、データベースに対してバッチ処理で一致するCPE2.3を検索し、単一のデータ検索に平均0.2秒しかかかりません。このツールはユーザーに信頼性の高いCPE2.3データを提供し、関連するCVEやMS Knowledgebaseなどの情報を関連付けることができます。"
		},
		"jumpcross": {
			"about": "Arbitrum One上で運営されているGameFiプロジェクトで、長期的な運営を目指し、チームとプレイヤーの収益性をバランスさせながら、手軽で高いプレイアビリティを重視してます。",
			"detail": "このGameFiプロジェクトでは、バックエンドシステムとEVMコントラクトの開発を担当しています。コントラクトについては、SolidityとHardHatを使用してドメイン名登録・解決コントラクト、ゲームトークンコントラクト、ゲームマスターコントラクトを開発しました。バックエンドシステムについては、ユーザーログイン状態処理、ゲームデータ記録、ゲーム同期、プラグインの監視など、6つのマイクロサービスを開発しました。また、http2とWebSocketを使用して、ユーザーとサーバー間の通信時間とコストを削減しています。\n加えて、XとDiscord Oauthも接続して、シビル攻撃の難易度を上げています。"
		},
		"vishybrid": {
			"about": "これはAIに基づいてマルチメディア信号放送ツールであり、リアルタイムで背景除去とモーションキャプチャをサポートしています。また、英語、簡体字中国語、繁体字中国語、日本語をサポートする使いやすいインターフェースを提供します。",
			"detail": "このツールはTauri + React + Tailwindを使用してインターフェースを構築し、バックエンドではOpenCVを使用して動画画像のリアルタイム処理（背景除去、モーションキャプチャ）を行い、FFmpegとメディアサーバー、NDI SDKを通じて配信し、その後PythonでAPIを構築してサービスを提供しています。\n\n本プロダクトは、さまざまなマルチメディア伝送ニーズを満たすため、複数の入力ソース（RTSP、NDI、Raw video）と出力プロトコル（RTSP-Opus、NDI-Opus、WebRTC-H264-Opus、WebRTC-VP8-Opus、CTP-AAC）をサポートしています。"
		},
		"pwdport": {
			"about": "このアプリは、多くの情報を覚える必要なく、安全なパスワードを生成するのに役立ちます。",
			"detail": "このパスワード生成ツールを使用することで、同じパスワードを使い回す習慣のある人々のセキュリティを向上させ、また情報セキュリティに敏感な人々により優れたパスワード生成ツールを提供することができます。"
		},
		"discord-member-verification-system": {
			"about": "これはNFTの保有を確認するDiscordメンバー認証システムです。",
			"detail": "このシステムの機能は、Discordアカウント所有者のWeb3ウォレットが指定されたトークンを保有しているかを確認し、また会員レベルの区別のためにトークン数をチェックすることです。\n\n技術的には、バックエンドでExpressJS、MongoDB、DiscordJSを使用して、Discord OAuthのAPIエンドポイントを提供し、メンバーデータの記録と更新を行っています。フロントエンドでは、ReactとTailwindをRainbow Kitと組み合わせて、使いやすいDAppを作成しています。"
		},
		"nft-market-sniper": {
			"about": "これは定期的にNFTマーケットプレイスウェブサイトの価格を監視し、ユーザーがチェックできるようDiscord Botに接続するクローラーです。",
			"detail": "これはCronosチェーン上のNFTマーケットプレイス - ebisu's bayを監視するDiscord Botで、購読者が選択したコレクションの最新のフロア価格を取得できます。\n\n技術的には、Pyppeteerを使用して定期的なクローリングとスナップショットを行い、価格が変更されたときにPycordを通じて関連情報をDiscordにプッシュしてユーザーに参照してもらいます。ユーザーはボットコマンドを通じてボットと対話することもできます。"
		},
		"travel-line-bot": {
			"about": "これはAIテキスト分割機能を備えた旅行ボットで、ユーザーは簡単な会話で異なる通貨の価格を確認でき、旅行に役立ついくつかの小機能も提供しています。",
			"detail": "これは、ユーザーが便利に旅行できるようにするLineボットで、台湾銀行のリアルタイム為替レートに基づいて台湾ドルと米ドルの価格を調べるためのユーザーフレンドリーなコマンドを提供しています。また、ユーザーが現在地の天気情報を確認し、メモを取るための便利なボタンも提供しています。\n\n技術的には、Djangoを使用してLine Bot用のコールバックAPIを構築しました。ユーザーコマンドはJiebaを使用して単語トークンに基づいてどのアクションを実行するかを判断します。為替レートは定期的に台湾銀行の為替レートをクロールして取得しています。"
		},
		"goink": {
			"about": "GoInkは開発者がサーバーを迅速に構築するのを助けるプロジェクトテンプレートです。Ginフレームワークを使用しています。",
			"detail": "このプロジェクトは以下のパブリックリポジトリをベースにしています：\n\n- Gin\n- swaggo\n- zap\n- lumberjack\n- golang-jwt\n\nこれは主流のインフラでWebサーバーを迅速に構築し、APIルート、ミドルウェア、データベース操作を迅速に開発するための環境を提供し、ファイル階層の計画とログのカスタマイズの時間を節約するために使用されます。"
		},
		"auto-interacter": {
			"about": "これはEVMコントラクトと完全に自動化された相互作用を行うスクリプトです。このリポジトリはScrollブロックチェーンとの相互作用に使用されます。",
			"detail": "このスクリプトは、ブロックチェーンプロジェクトのエアドロップに参加する人気が高まる中で生まれました。手動でのプロジェクト相互作用がますます報酬を得られなくなり、多数のアカウントを使用した自動化された相互作用が多くの人々にとって必要になってきたためです。\n\n私はこのプロジェクトを開発して自身のブロックチェーンの知識とスキルを向上させ、他の人々に自動化されたコントラクト相互作用の方法を学ぶ機会を提供することを目的としていました。\n\nこのプロジェクトは主にEthersJSを使用してEVMコントラクトと相互作用し、開発時間の大部分は各プロジェクトのコントラクトのABIとコントラクト相互作用の戻り値の分析に費やされています。"
		},
		"recipe-master": {
			"about": "これは私の学士（コンピュータサイエンス）卒業プロジェクトで、コンピュータグラフィックスのテーマに分類されます。写真を使用してレシピを探すウェブアプリケーションです。",
			"detail": "このソフトウェアは、クローラーと画像検索技術を組み合わせたソフトウェアで、ユーザーはFlaskによって構築されたAPIエンドポイントに画像をアップロードすることができ、画像は一連の知覚ハッシュアルゴリズムを通じてOpenCVによって処理され、リモートおよびローカルの画像データベースと比較して、画像内の食品が分類に属する可能性が最も高いかを確認し、ユーザーにレシピへの関連リンクを返送します。"
		},
		"mymemo": {
			"about": "これはQt5で作成したシンプルなGUIカレンダープログラムです。",
			"detail": "在学中にテキストベースのプログラムをたくさん練習し開発し、GUIプログラムに興味を持ち、一般的なGUIアプリケーションの実現原理を理解したいと思うようになりました。 短いリサーチを経た後、在学中は主にC++で開発していたため、Qt5フレームワークを使って初めてのGUIプログラムを開発することにしました。\n\nパフォーマンスを最適化するためにC++のSTLとポインタ処理を多用し、Qt Designerを使ってインターフェースを設計し、インタラクティブなコンポーネントをロジカルファンクションにバインドしました。 開発の間、私はシステムレベルのライブラリも使って、アプリケーションがレジストリファイルに登録され、ブート時に自動的に起動するようにしました。"
		}
	},
	"links": {
		"footer-msg": "ビジネスのご相談は上記の連絡先からお気軽にご連絡ください。できるだけ早くご返信致します。"
	},
	"theme": {
		"dark": "ダーク",
		"light": "ライト"
	},
	"language": "言語",
	"tip": {
		"suggestUseComputer": "最適な閲覧体験のため、パソコンでご覧いただくことをおすすめします。"
	}
}